# Analytický report
DBS 2018 - Križan Richard, Mizera Tomáš

Pre analytický report je použitý python spolu s knižnicou pandas a numpy, pre lepšie, prehľadnejšie a jednoduchšie pracovanie s dátami. Ako prostredie je použitý jupyter notebook.

Každá entita (jej zmysel, atribúty a vzťahy) je opísaná v dokumentácii - zložka doc, súbor readme.md. V dokumentácii je taktiež opísaný postup generácie dát aj prostredie a spôsob v akom boli dáta generované.

Len pre potreby analytického reportu: projekt je písaný v jazyku Ruby s frameworkom on Rails a postgresql databázou, dáta sme generovali s nástrojou (v ruby gemom) Faker. Ruby ku každej entite pridáva 2 atribúty, a to dátum vytvorenia záznamu a dátum poslednej zmeny.

Faker generuje dáta s minimom duplicitných dát, čo budeme môcť vidieť pri viacerých nominálnych atribútoch.

#### Príprava prostredia na analýzu (pripájanie na databázu)

In [2]:
import psycopg2
import sys
import pandas as pd

In [3]:
dsn_database = "dbs_2018"
dsn_hostname = "localhost"
dsn_port = "5432"
dsn_uid = "postgres"
dsn_pwd = ""

In [4]:
try:
    conn_string = "host="+dsn_hostname+" port="+dsn_port+" dbname="+dsn_database+" user="+dsn_uid+" password="+dsn_pwd
    print (f'Connecting to database\n  -> {conn_string}')
    conn=psycopg2.connect(conn_string)
    print ("Connected!\n")
except:
    print ("Unable to connect to the database.")

Connecting to database
  -> host=localhost port=5432 dbname=dbs_2018 user=postgres password=
Connected!

# Analýza jednotlivých entít

Analyzovanie entít podľa kritérií na stránke predmetu

## Entita customers

In [28]:
customers = pd.read_sql('select * from customers', con=conn)

In [30]:
customers.head(10)

,id,first_name,last_name,birth_date,id_card_number,street,city,zip,street_number,created_at,updated_at
0,1,Benny,Goodwin,1978-06-03,4061480,O'Reilly Overpass,East Salvador,62023,1864,2018-03-22 14:05:24.953434,2018-03-22 14:05:24.953434
1,2,Gerhard,Satterfield,1990-12-06,3225650,Klein Key,Chelseyside,90809,964,2018-03-22 14:05:24.960418,2018-03-22 14:05:24.960418
2,3,Marley,Murazik,1985-06-08,9831583,Barrows Rapids,East Ednaview,41451,8733,2018-03-22 14:05:24.968648,2018-03-22 14:05:24.968648
3,4,Jodie,Hessel,1986-11-18,2068099,Muller Mountain,North Morris,72260,7603,2018-03-22 14:05:24.973278,2018-03-22 14:05:24.973278
4,5,Janelle,Welch,1995-12-23,5036284,Runolfsdottir Stravenue,East Elveraburgh,37322,137,2018-03-22 14:05:24.978202,2018-03-22 14:05:24.978202
5,6,Sierra,VonRueden,1965-10-13,5322742,Marty Lock,West Dagmarville,24773,26836,2018-03-22 14:05:24.984350,2018-03-22 14:05:24.984350
6,7,Ova,Pfannerstill,1973-02-11,8127471,Wilderman Corners,Port Abbieton,28741,607,2018-03-22 14:05:24.989368,2018-03-22 14:05:24.989368
7,8,Kristoffer,Auer,1990-05-21,7690579,Bernhard Shoal,Lake Evabury,83528,541,2018-03-22 14:05:24.993886,2018-03-22 14:05:24.993886
8,9,Brielle,O'Kon,1971-11-04,2005133,Royal Points,Port Jean,19153,3727,2018-03-22 14:05:24.998589,2018-03-22 14:05:24.998589
9,10,Nathaniel,Roberts,1989-12-08,4722284,Manuel Run,Codyville,59946,240,2018-03-22 14:05:25.003026,2018-03-22 14:05:25.003026

Počet riadkov

In [30]:
customers.shape[0]

1000000

Entita customers obsahuje iba nominálne atribúty ako street_number, zip, id_card_number, meno, dátum narodenia... Pre tieto vyjadríme iba početnosť rôznych hodnôt, nakoľko vygenerovaných záznamov je priveľa na zobrazenie.

Pre jednoduchosť zobrazíme 3 z týchto atribútov:

In [23]:
customers['street_number'].nunique()

97672

In [24]:
customers['zip'].nunique()

89999

In [25]:
customers['id_card_number'].nunique()

946261

## Entita computers

In [ ]:
computers = pd.read_sql('select * from computers', con=conn)

In [25]:
computers.head(10)

,id,cpu_name,cpu_clock,cpu_cores,gpu_name,gpu_clock,gpu_cores,created_at,updated_at,customer_id
0,1,doloremque,3.17,14,animi,6.29,31,2018-03-22 20:51:36.543557,2018-03-22 20:51:36.543557,721
1,2,neque,4.59,10,repellat,7.86,22,2018-03-22 20:51:36.550697,2018-03-22 20:51:36.550697,63
2,3,harum,6.34,8,necessitatibus,7.11,27,2018-03-22 20:51:36.556375,2018-03-22 20:51:36.556375,735
3,4,placeat,4.82,3,dicta,8.55,1,2018-03-22 20:51:36.561837,2018-03-22 20:51:36.561837,493
4,5,nam,5.63,7,odit,3.45,27,2018-03-22 20:51:36.567102,2018-03-22 20:51:36.567102,702
5,6,doloremque,7.72,3,aut,2.57,25,2018-03-22 20:51:36.572245,2018-03-22 20:51:36.572245,6
6,7,ipsum,7.68,11,voluptas,7.01,23,2018-03-22 20:51:36.577430,2018-03-22 20:51:36.577430,12
7,8,commodi,4.96,16,deserunt,1.15,29,2018-03-22 20:51:36.582718,2018-03-22 20:51:36.582718,366
8,9,atque,0.55,6,atque,9.04,10,2018-03-22 20:51:36.588160,2018-03-22 20:51:36.588160,329
9,10,voluptatum,4.73,12,ullam,1.47,6,2018-03-22 20:51:36.593614,2018-03-22 20:51:36.593614,801

Počet riadkov:

In [29]:
computers.shape[0]

1012257

Entita computers obsahuje viaceré doménové numerické atribúty - cpu_clock, cpu_cores, gpu_clock a gpu_cores, pre tieto vypočítame základné deskriptívne štatistiky:

In [31]:
computers[['cpu_clock', 'cpu_cores', 'gpu_clock', 'gpu_cores']].describe()

          cpu_clock     cpu_cores     gpu_clock     gpu_cores
count  1.012257e+06  1.012257e+06  1.012257e+06  1.012257e+06
mean   4.999323e+00  8.501203e+00  4.995111e+00  1.650285e+01
std    2.887521e+00  4.612316e+00  2.885457e+00  9.239202e+00
min    1.000000e-02  1.000000e+00  1.000000e-02  1.000000e+00
25%    2.490000e+00  4.000000e+00  2.510000e+00  8.000000e+00
50%    4.990000e+00  9.000000e+00  4.980000e+00  1.700000e+01
75%    7.510000e+00  1.300000e+01  7.490000e+00  2.500000e+01
max    9.990000e+00  1.600000e+01  9.990000e+00  3.200000e+01

Priemerný počet počítačov na jedného zákazníka banky:

In [67]:
computers.groupby(['customer_id']).size().sum()/1000000

1.012257

## Entita banks

In [41]:
banks = pd.read_sql('select * from banks', con=conn)

In [72]:
banks.head(10)

,id,bank_name,street,city,estabilished_date,created_at,updated_at,street_number
0,1,"Rempel, Rath and Nitzsche",Herminio Light,Wernerland,1978-05-20,2018-03-22 15:20:53.932154,2018-03-22 15:20:53.932154,8586
1,2,"Crooks, Hintz and Denesik",Morar Wells,East Eltonfurt,1992-01-15,2018-03-22 15:20:53.936379,2018-03-22 15:20:53.936379,538
2,3,"McGlynn, Kreiger and Greenholt",Fahey Cape,Lake Kaylee,2010-09-08,2018-03-22 15:20:53.940176,2018-03-22 15:20:53.940176,1388
3,4,"McClure, Simonis and O'Kon",Heaney Plains,South Mariastad,1994-09-03,2018-03-22 15:20:53.943988,2018-03-22 15:20:53.943988,4504
4,5,Smith LLC,Marquise Meadows,Emmaburgh,1887-08-24,2018-03-22 15:20:53.947756,2018-03-22 15:20:53.947756,12781
5,6,Feest-Ebert,Vito Course,Kiarrabury,1965-11-21,2018-03-22 15:20:53.951475,2018-03-22 15:20:53.951475,52893
6,7,Ondricka-Dietrich,DuBuque Flat,Port Kristina,1761-03-08,2018-03-22 15:20:53.955267,2018-03-22 15:20:53.955267,7032
7,8,Beier-Collier,Rohan Circles,East Harvey,1983-11-05,2018-03-22 15:20:53.959106,2018-03-22 15:20:53.959106,91481
8,9,"Purdy, Parker and Kutch",Keenan Circles,Naderland,1886-08-03,2018-03-22 15:20:53.962917,2018-03-22 15:20:53.962917,60928
9,10,Brakus-Marquardt,Schulist Walk,Wisokyside,2000-01-22,2018-03-22 15:20:53.966887,2018-03-22 15:20:53.966887,4467

Počet riadkov:

In [28]:
banks.shape[0]

1000000

Entita banks obsahuje iba nominálne atribúty ako street, city, bank_name, id,... Pre tieto vyjadríme iba početnosť rôznych hodnôt, nakoľko vygenerovaných záznamov je priveľa na zobrazenie.

In [73]:
banks['bank_name'].nunique()

1000000

In [74]:
banks['street'].nunique()

415147

In [75]:
banks['city'].nunique()

263333

## Entita accounts

In [5]:
accounts = pd.read_sql('select * from accounts', con=conn)

In [50]:
accounts.head(10)

,id,number,balance,created_at,updated_at,customer_id,bank_id,currency_id,acc_type_id
0,1,SK214055731027183612226744,685,2018-03-22 16:34:08.058001,2018-03-22 16:34:08.058001,551,934,6,4
1,2,SK917993348635528966149279,524,2018-03-22 16:34:08.066979,2018-03-22 16:34:08.066979,869,981,5,3
2,3,SK434392635243935869180523,341,2018-03-22 16:34:08.075089,2018-03-22 16:34:08.075089,391,307,4,5
3,4,SK064592964584197702631488,179,2018-03-22 16:34:08.083235,2018-03-22 16:34:08.083235,117,85,3,3
4,5,SK562458383369559669583805,83,2018-03-22 16:34:08.091428,2018-03-22 16:34:08.091428,34,409,1,1
5,6,SK755968546664664323524643,822,2018-03-22 16:34:08.099597,2018-03-22 16:34:08.099597,985,717,2,4
6,7,SK527423817847432980528197,552,2018-03-22 16:34:08.107384,2018-03-22 16:34:08.107384,874,973,3,2
7,8,SK790065868843933003280802,579,2018-03-22 16:34:08.114807,2018-03-22 16:34:08.114807,172,671,10,5
8,9,SK788306418528193507670717,450,2018-03-22 16:34:08.122193,2018-03-22 16:34:08.122193,140,154,1,4
9,10,SK133049194048790454885043,271,2018-03-22 16:34:08.129538,2018-03-22 16:34:08.129538,481,722,8,3

Počet riadkov:

In [51]:
accounts.shape[0]

1000000

Deskriptívne štatistiky pre atribút balance:

In [6]:
accounts['balance'].describe()

count    1000000.000000
mean         500.250005
std          288.604480
min            1.000000
25%          251.000000
50%          500.000000
75%          750.000000
max         1000.000000
Name: balance, dtype: float64

Početnosť jednotlivých hodnôt v currency_id, čo predstavuje v akej mene je účet vedený:

In [39]:
pd.merge(left = accounts, right = currencies, left_on="currency_id", right_on="id", how="inner")['name'].value_counts()

Etherum     100450
SALT        100312
IOTA        100193
Bitcoin     100106
Cardano     100082
Stellar     100036
Hshare       99997
Ripple       99856
DigixDAO     99719
Litecoin     99249
Name: name, dtype: int64

## Entita transactions

In [44]:
transactions = pd.read_sql('select * from transactions', con=conn)

In [12]:
transactions.head(10)

,id,name,ammount,date,created_at,updated_at,account_id,currency_id,trans_type_id,trans_state_id
0,1,Meraxes,3246,2015-10-18,2018-03-22 18:39:21.848728,2018-03-22 18:39:21.848728,387,2,5,5
1,2,Tyraxes,4398,2016-04-23,2018-03-22 18:39:21.857747,2018-03-22 18:39:21.857747,330,2,2,5
2,3,Syrax,7609,2016-03-02,2018-03-22 18:39:21.865628,2018-03-22 18:39:21.865628,805,8,2,4
3,4,Vermithrax,6669,2018-01-28,2018-03-22 18:39:21.873698,2018-03-22 18:39:21.873698,675,4,3,4
4,5,Valryon,9302,2015-08-07,2018-03-22 18:39:21.882049,2018-03-22 18:39:21.882049,916,3,1,5
5,6,Vhagar,1029,2018-01-18,2018-03-22 18:39:21.890007,2018-03-22 18:39:21.890007,823,5,4,2
6,7,Balerion,7892,2015-07-03,2018-03-22 18:39:21.897544,2018-03-22 18:39:21.897544,307,7,5,1
7,8,Viserion,4211,2017-10-18,2018-03-22 18:39:21.905232,2018-03-22 18:39:21.905232,522,9,5,2
8,9,Rhaegal,4188,2018-02-04,2018-03-22 18:39:21.912642,2018-03-22 18:39:21.912642,947,10,2,5
9,10,Tyraxes,3970,2016-08-28,2018-03-22 18:39:21.919848,2018-03-22 18:39:21.919848,487,8,4,2

Počet riadkov:

In [13]:
transactions.shape[0]

10000610

Priemerný počet transakcií na jeden účet:

In [45]:
transactions.groupby(['account_id']).size().sum()/accounts.shape[0]

10.00061

Deskriptívne štatistiky pre hodnotu transakcie:

In [47]:
transactions['ammount'].describe()

count    1.000061e+07
mean     4.999397e+03
std      2.887494e+03
min      1.000000e+00
25%      2.498000e+03
50%      4.998000e+03
75%      7.500000e+03
max      1.000000e+04
Name: ammount, dtype: float64

## Entita pools

In [48]:
pools = pd.read_sql('select * from pools', con=conn)

In [49]:
pools.head(10)

,id,name,income,created_at,updated_at,bank_id,currency_id
0,1,15sqjEFzZrRTkrQvCLrYm1iHixXLsyBnGj,2411,2018-03-22 23:19:09.356507,2018-03-22 23:19:09.356507,231,4
1,2,1GwUUepYxSZQ7HWeX2TettHv6RPJK4RXw2,330,2018-03-22 23:19:09.366460,2018-03-22 23:19:09.366460,621,7
2,3,1Pj7nhYqEN8xCZ3jPgYzp2dHPnDg3oUdEq,2752,2018-03-22 23:19:09.374788,2018-03-22 23:19:09.374788,113,10
3,4,15optdLeEgJU149oF7qtDaMUeuaSTfkaiQ,4316,2018-03-22 23:19:09.382392,2018-03-22 23:19:09.382392,731,8
4,5,1Efrk9DumDcXMvu9kWbSML6mu7bonFTqEL,1320,2018-03-22 23:19:09.389829,2018-03-22 23:19:09.389829,700,2
5,6,12aA6gHVmnZkFrrrRkWrzToExAMaJBLoTy,1923,2018-03-22 23:19:09.396997,2018-03-22 23:19:09.396997,306,5
6,7,1L5CYVGGYJPFQaDXbfdnawzrrUfCYrP4y9,3411,2018-03-22 23:19:09.405019,2018-03-22 23:19:09.405019,205,5
7,8,18nZbxhJR6KE2u4XeBQGB8ZtcPsyMkq4U9,4402,2018-03-22 23:19:09.412043,2018-03-22 23:19:09.412043,435,1
8,9,1HHywC2sqCuuPpdXcJd8noxXBpz66dHtnK,3730,2018-03-22 23:19:09.418624,2018-03-22 23:19:09.418624,336,4
9,10,13GtPq7ymoMNeyNYa48jPMhBJv2dK4BanS,4781,2018-03-22 23:19:09.425538,2018-03-22 23:19:09.425538,390,4

Počet riadkov

In [21]:
pools.shape[0]

1000000

Deskriptívna štatistika pre príjem poolov

In [50]:
pools['income'].describe()

count    1000000.000000
mean        2501.958917
std         1443.208282
min            1.000000
25%         1252.000000
50%         2501.000000
75%         3752.000000
max         5000.000000
Name: income, dtype: float64

Priemerný počet poolov na jednu banku:

In [51]:
pools.groupby(['bank_id']).size().sum()/banks.shape[0]

1.0

## Entita mining_histories

In [53]:
mining_histories = pd.read_sql('select * from mining_histories', con=conn)

In [54]:
mining_histories.head(10)

,id,connected_at,disconnected_at,created_at,updated_at,computer_id,pool_id
0,1,2018-03-08,2017-05-30,2018-03-23 02:36:29.391165,2018-03-23 02:36:29.391165,782,962
1,2,2017-09-21,2018-02-22,2018-03-23 02:36:29.398829,2018-03-23 02:36:29.398829,742,285
2,3,2017-07-10,2017-05-25,2018-03-23 02:36:29.405610,2018-03-23 02:36:29.405610,686,208
3,4,2017-12-06,2018-03-04,2018-03-23 02:36:29.412125,2018-03-23 02:36:29.412125,512,711
4,5,2016-12-15,2017-12-25,2018-03-23 02:36:29.418888,2018-03-23 02:36:29.418888,312,197
5,6,2017-12-13,2017-02-22,2018-03-23 02:36:29.425435,2018-03-23 02:36:29.425435,752,393
6,7,2018-02-14,2018-01-23,2018-03-23 02:36:29.431833,2018-03-23 02:36:29.431833,317,685
7,8,2018-02-15,2017-08-06,2018-03-23 02:36:29.438093,2018-03-23 02:36:29.438093,481,92
8,9,2018-01-06,2017-06-03,2018-03-23 02:36:29.444448,2018-03-23 02:36:29.444448,880,643
9,10,2017-08-30,2017-07-20,2018-03-23 02:36:29.451058,2018-03-23 02:36:29.451058,449,359

Počet riadkov:

In [55]:
mining_histories.shape[0]

1018171

Priemerný počet počítačov na jeden pool

In [60]:
mining_histories.groupby(['computer_id']).size().sum()/pools.shape[0]

1.018171

## Entita income_by_customers

In [61]:
income_by_customers = pd.read_sql('select * from income_by_custommers', con=conn)

In [38]:
income_by_customers.head(10)

,id,date,income,created_at,updated_at,customer_id,pool_id
0,1,2018-03-01,2805,2018-03-23 00:59:40.769931,2018-03-23 00:59:40.769931,746,566
1,2,2018-02-13,3773,2018-03-23 00:59:40.777155,2018-03-23 00:59:40.777155,517,717
2,3,2018-03-14,3844,2018-03-23 00:59:40.783312,2018-03-23 00:59:40.783312,524,403
3,4,2018-02-28,720,2018-03-23 00:59:40.789399,2018-03-23 00:59:40.789399,474,595
4,5,2018-03-05,1599,2018-03-23 00:59:40.795510,2018-03-23 00:59:40.795510,480,443
5,6,2018-02-05,3524,2018-03-23 00:59:40.801740,2018-03-23 00:59:40.801740,348,883
6,7,2018-03-12,515,2018-03-23 00:59:40.807837,2018-03-23 00:59:40.807837,771,818
7,8,2018-02-03,4416,2018-03-23 00:59:40.813765,2018-03-23 00:59:40.813765,814,879
8,9,2018-02-04,4105,2018-03-23 00:59:40.819794,2018-03-23 00:59:40.819794,84,677
9,10,2018-02-05,771,2018-03-23 00:59:40.825757,2018-03-23 00:59:40.825757,517,230

Počet riadkov:

In [59]:
income_by_customers.shape[0]

1000000

Deskriptívne štatistiky pre príjem z poolov

In [63]:
income_by_customers['income'].describe()

count    1000000.000000
mean        2498.434662
std         1443.678408
min            1.000000
25%         1247.000000
50%         2500.000000
75%         3747.000000
max         5000.000000
Name: income, dtype: float64

## Ukážka číselníkov

#### Meny

In [32]:
currencies = pd.read_sql('select * from currencies', con=conn)

In [54]:
currencies.head(10)

,id,name,value,created_at,updated_at
0,1,Bitcoin,9155.1700,2018-03-22 14:04:07.868220,2018-03-22 14:04:07.868220
1,2,Etherum,583.4700,2018-03-22 14:04:07.869783,2018-03-22 14:04:07.869783
2,3,Ripple,0.7120,2018-03-22 14:04:07.871016,2018-03-22 14:04:07.871016
3,4,Litecoin,174.7400,2018-03-22 14:04:07.872202,2018-03-22 14:04:07.872202
4,5,Cardano,0.2235,2018-03-22 14:04:07.873448,2018-03-22 14:04:07.873448
5,6,Stellar,0.2660,2018-03-22 14:04:07.874650,2018-03-22 14:04:07.874650
6,7,IOTA,1.4300,2018-03-22 14:04:07.876048,2018-03-22 14:04:07.876048
7,8,DigixDAO,366.7800,2018-03-22 14:04:07.877572,2018-03-22 14:04:07.877572
8,9,Hshare,6.5100,2018-03-22 14:04:07.879082,2018-03-22 14:04:07.879082
9,10,SALT,2.7600,2018-03-22 14:04:07.880485,2018-03-22 14:04:07.880485

#### Stav transakcie

In [65]:
trans_state = pd.read_sql('select * from trans_states', con=conn)
trans_state.head(5)

,id,label,created_at,updated_at
0,1,Done,2018-03-22 14:04:07.916948,2018-03-22 14:04:07.916948
1,2,Pending,2018-03-22 14:04:07.918351,2018-03-22 14:04:07.918351
2,3,Blocked,2018-03-22 14:04:07.919384,2018-03-22 14:04:07.919384
3,4,Not paid yet,2018-03-22 14:04:07.920338,2018-03-22 14:04:07.920338
4,5,Waiting for approval,2018-03-22 14:04:07.921288,2018-03-22 14:04:07.921288

#### Typy transakcii

In [67]:
trans_type = pd.read_sql('select * from trans_types', con=conn)
trans_type.head(5)

,id,label,created_at,updated_at
0,1,Money transfer from pool to account,2018-03-22 14:04:07.904351,2018-03-22 14:04:07.904351
1,2,Money transfer from account to pool,2018-03-22 14:04:07.905776,2018-03-22 14:04:07.905776
2,3,Money transfer between accounts,2018-03-22 14:04:07.906934,2018-03-22 14:04:07.906934
3,4,External money transfer,2018-03-22 14:04:07.908034,2018-03-22 14:04:07.908034
4,5,Bank fees,2018-03-22 14:04:07.909137,2018-03-22 14:04:07.909137

#### Typy účtov

In [68]:
acc_type = pd.read_sql('select * from acc_types', con=conn)
acc_type.head(5)

   id             label                 created_at                 updated_at
0   1           Classic 2018-03-22 14:04:07.890920 2018-03-22 14:04:07.890920
1   2         Investing 2018-03-22 14:04:07.892440 2018-03-22 14:04:07.892440
2   3             Debet 2018-03-22 14:04:07.893543 2018-03-22 14:04:07.893543
3   4     Crypto Maniac 2018-03-22 14:04:07.895013 2018-03-22 14:04:07.895013
4   5  EXXXTREME Minner 2018-03-22 14:04:07.896120 2018-03-22 14:04:07.896120